// Есть две коробки, первая размером A1×B1×C1, вторая размером A2×B2×C2. Определите, 
// можно ли разместить одну из этих коробок внутри другой, при условии, что поворачивать 
// коробки можно только на 90 градусов вокруг ребер.

#include <iostream>
using namespace std;

int main()
{
	int a1,b1,c1,a2,b2,c2;
    cin >> a1 >> b1 >> c1 >> a2 >> b2 >> c2;

    // Решение: находим длинную среднюю и короткую сторону каждой коробки и срвнимаем их,
    // если длинная каждая из сторон больше другой, то можно вложить одну в другую    

    return 0;

}
