// N белочек нашли K орешков и решили разделить их поровну. Определите, сколько орешков достанется каждой белочке.

#include <iostream>

using namespace std;

int main() {

    int a,b;
    cin>>a>>b;
    cout << b/a;
    return 0;
}